[
  {
    "id": "q-access-1",
    "questionText": "Which users should be able to see the 'Delivered At' column? Is it only for Ops/Support users, or should other roles have access too?",
    "type": "single_select",
    "required": true,
    "options": [
      "Ops/Support only",
      "All users",
      "Specific roles"
    ],
    "rationale": "Understanding user access helps define visibility rules for the new column."
  },
  {
    "id": "q-ui-1",
    "questionText": "Should the 'Delivered At' column be visible by default, or should users have the option to show/hide it?",
    "type": "single_select",
    "required": true,
    "options": [
      "Visible by default",
      "Optional to show/hide"
    ],
    "rationale": "This affects the initial table setup and user customization options."
  },
  {
    "id": "q-error-1",
    "questionText": "If the delivery date is not available, should the column display '—' or 'Not Delivered'? Is there a preference for one over the other?",
    "type": "single_select",
    "required": true,
    "options": [
      "—",
      "Not Delivered"
    ],
    "rationale": "Consistency in messaging helps users understand the status of undelivered parcels."
  },
  {
    "id": "q-flow-1",
    "questionText": "When sorting the 'Delivered At' column, should it affect the current pagination and filtering settings, or reset them?",
    "type": "single_select",
    "required": true,
    "options": [
      "Affect current settings",
      "Reset settings"
    ],
    "rationale": "This determines how sorting interacts with other table functionalities."
  },
  {
    "id": "q-data-1",
    "questionText": "Is there a specific format required for the 'Delivered At' timestamp, or should it use the system's default date-time format?",
    "type": "single_select",
    "required": true,
    "options": [
      "Specific format: DD MMM YYYY, hh:mm A",
      "System default format"
    ],
    "rationale": "Ensures the date-time is displayed in a user-friendly and consistent manner."
  },
  {
    "id": "q-priority-1",
    "questionText": "Is the addition of the 'Delivered At' column a high-priority change, or can it be phased in with other updates?",
    "type": "single_select",
    "required": true,
    "options": [
      "High priority",
      "Phased with other updates"
    ],
    "rationale": "Understanding the urgency helps prioritize development efforts."
  },
  {
    "id": "q-scope-1",
    "questionText": "Are there any other changes planned for the Parcels table that should be considered alongside this enhancement?",
    "type": "text",
    "required": false,
    "rationale": "Identifying related changes can help coordinate updates and avoid conflicts."
  }
]